{
    "A": [
        {
            "intro_title": "Altcoin",
            "intro_desc": "<p>Ever since Bitcoin’s launch and quick success in 2009, the world witnessed the launch of several other cryptocurrencies. All these cryptocurrencies, developed and launched after Bitcoin are collectively called altcoins.</p>",
            "description": [
                {
                    "title": "Additional Information:",
                    "paragraphs": [
                        "<p>The word 'altcoin' is a portmanteau of 'alt' (short for alternative) and 'coin' (referring to crypto-tokens or ‘coins’). Most altcoins attempt to replicate the decentralized, peer-to-peer (P2P) structure of Bitcoin while also trying to fix pertinent issues with Bitcoin, with varying results.</p>",
                        "<p>Some major issues with Bitcoin that altcoins have tried to address are slow transactions, which can take upto 10 minutes to be fully processed, and high fees for transactions or trades. Ethereum, an altcoin with a fairly large user base, has managed to offer faster transaction speeds with lower fees and increased security.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>Launched in April 2011, Namecoin was one of the first Bitcoin alternatives, and used the same proof-of-work algorithm. Namecoin allowed miners to generate an individual .bit domain for mining, having an increased focus on user anonymity. Litecoin, another early alternative to Bitcoin, was launched in October of the same year, and instead of being a direct competitor was touted more as the 'silver to Bitcoin's gold.' Litecoin has much faster transaction speeds compared to Bitcoin.</p>",
                        "<p>While altcoins have a multitude of classifications, the two basic types are stablecoins and mining-based cryptocurrencies. Altcoins like Ethereum are mining-based, complex cryptographic puzzles are solved to generate, or mine, new blocks aka coins. On the other hand for stablecoins, the values of altcoins like USDC, USDT, and DAI are pegged to another commodity, which can be another cryptocurrency, a fiat (non-digital) currency, or even a exchange-traded physical commodity such as gold which reduces market volatility and price uncertainty.</p>"
                    ]
                }
            ]
        }       
    ],
    "B": [
        {
            "intro_title": "Bitcoin",
            "intro_desc": "<p>Bitcoin is digital currency released in 2008. It is the world’s first and biggest <a href='#Cryptocurrency'>cryptocurrency</a>, since its operation, functioning and issuance are based on the principles of cryptography.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Bitcoin was released in 2008, on the heels of the housing bubble and crash, by an individual or group of people working under the pseudonym Satoshi Nakamoto. The Bitcoin whitepaper released by Satoshi Nakamoto elaborated on the principles and motivations behind Bitcoin’s introduction and its real-world utility.</p>",
                        "<p>Since the housing bubble crisis was majorly attributed to the abuse of financial power by big banks and financial entities, Bitcoin’s launch was based on the ideals of eradicating this centralized power and giving people power over their money.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>This is why Bitcoin is a decentralized currency. No single authority can govern Bitcoin. Instead, it operates as a peer-to-peer network. Each network entity is called a 'node' and exerts equal power in the network. All this is enabled by blockchain technology, which forms the bedrock of Bitcoin’s functioning.</p>",
                        "<p>The blockchain is immutable, and transparent. So all nodes in a network can see every transaction, and every wallet/s balance. Simultaneously, they are also practically prohibited from changing these, since any change requires the consensus of a majority (51%+) of the network. Every node in the Bitcoin network saves its copy of the blockchain.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Bitcoin Mining",
            "intro_desc": "<p>New bitcoins are introduced into the Bitcoin network via a process called mining, and thus into circulation. Simultaneously, transactions are validated, confirmed and propagated on the network. It is the only process of its kind on the Bitcoin network, with no alternative.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Bitcoin is based on a form of distributed ledger technology, called the blockchain. A blockchain is essentially a set of unique blocks of information, where each block is connected to its predecessor, forming a chain. To add a new block to the Bitcoin blockchain, nodes compete to solve complex cryptographic puzzles via their computing hardware. This process is based on a consensus algorithm called 'Proof of Work', which rewards new bitcoins to those nodes that successfully complete the puzzle, and get the opportunity to add new blocks to the Bitcoin blockchain.</p>",
                        "<p>Individuals engaging in this process are called Bitcoin miners, since the process is akin to hunting for bitcoins and finding a reward. Since Bitcoin is decentralized and has no central authority, the network requires a way to determine the legitimacy of each transaction. The Bitcoin miners do this by verifying the transactions based on the rules of the network, and then putting together them in a block. This block is then added to the blockchain and is then forever available for everyone to verify and confirm.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>The cryptographic problems are complex in nature and cannot be practically solved manually. They require specialized, high-performance computing devices, and since the first miner to verify the transactions is rewarded with new Bitcoin units for their efforts, this system incentivizes increasingly powerful systems.</p>"
                    ]
                }
            ]
        },   
        {
            "intro_title": "Blockchain",
            "intro_desc": "<p>A blockchain is essentially a digital ledger that stores records of transactions, duplicated and distributed across a network of computer systems. Each block in the chain accommodates several transactions. Once a transaction is added or validated, every block in the network adds the transaction into their ledger. </p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>If one of the blocks in the network has been compromised due to a malicious transaction, the blockchain will immediately know that one of the blocks has been tampered with and hence can be terminated. To successfully hack the network, the attackers need to change every block across the distributed versions of the chain. Therefore, it is almost impossible to hack an entire blockchain.</p>",
                        "<p>Bitcoin and Ethereum are some of the most famous blockchain networks in the world. The addition of new blocks in these systems adds up the security of the blockchain.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Bitcoin Futures",
            "intro_desc": "<p>Just like stock or commodities futures, Bitcoin futures is a legal agreement of trading a cryptocurrency at a predetermined date and price. Bitcoin futures allow investors to speculate on the future prices of a given cryptocurrency.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>The introduction of Bitcoin futures has affected markets in a significant way. Investors can carry out leverage trading and benefit from cryptocurrency's volatility without holding Bitcoin.</p>",
                        "<p>There are a number of benefits of futures trading instead of holding or trading in the spot market. Primarily, the contracts are traded on the regulated exchange; these Bitcoin futures are regulated by Commodity Futures Trading Commission, giving institutional investors confidence to participate. Since Bitcoin futures are cash-settled, there no need for a Bitcoin wallet or any kind of physical exchange.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Bollinger band",
            "intro_desc": "<p>A Bollinger Band is a technical analysis indicator that is defined by a set of trendlines plotted by two standard deviations and a Simple Moving Average(SMA). Both of these deviations are plotted above (positively) and below (negatively) the SMA of a cryptocurrency's price.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>Bollinger Bands are copyrighted by its developer - John Bollinger, who is an accomplished technical trader. Bollinger Bands give investors a higher sense of market understanding and hence can be proved to be very useful.</p>"
                    ]
                }
            ]
        }
    ],
    "C": [
        {
            "intro_title": "Cryptocurrency",
            "intro_desc": "<p>A cryptocurrency is a virtual asset secured and operated on the principles of cryptography and often decentralized i.e run without any single authority or entity’s influence.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Typically, cryptocurrencies are based on a blockchain, and the cryptocurrency network features a group of connected devices called 'nodes.’ Every transaction initiated and completed using a cryptocurrency network is saved in this blockchain.</p>",
                        "<p>A cryptocurrency is usually a community-driven decentralized network for exchange of monetary value, ownership and other analogues. Since it is decentralized, there is no influence of central authorities like governments and financial institutions in the day to day functioning of the cryptocurrency. Instead, a cryptocurrency relies on its ‘blockchain’ for basic operations such as transaction processing, coin issuance, etc.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>These operations on the blockchain are governed by predefined protocols that determine the fate of all activities on the network.</p>",
                        "<p>Bitcoin is the first, and biggest cryptocurrency. Ethereum is another popular cryptocurrency.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Candlesticks",
            "intro_desc": "<p>A candlestick is a method of plotting prices on a graph or a chart; a single candlestick can show the open, high, low, and closing price of a cryptocurrency in a pre-defined period. Even though it was first used in the 18th century, candlestick charts are used by almost everyone for technical and financial analysis in financial markets.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>Candlesticks are colored red and green to indicate a bearish or bullish nature in that given time period. If the price at the time of opening is lower than the price at the time of closing, the candle is of green color, indicating a bullish nature in that time period; also, the inverse is also true.</p>"
                    ]
                }
            ]
        }   
    ],
    "D": [
        {
            "intro_title": "DEX / Decentralized Exchange",
            "intro_desc": "<p>A cryptocurrency exchange that operates on a peer-to-peer model instead of having a central authority with full access and authority over the exchange is called a DEX or decentralized exchange.</p>",
            "description": [
                {
                    "title": "Additional information:",
                    "paragraphs": [
                        "<p>Since a DEX works on the principles of peer-to-peer trading, a DEX never holds custody of any traders’ coins or acts as a wallet to store trade profits in. This effectively limits the security risk that users face with stored crypto deposits on centralized exchanges.</p>",
                        "<p>Usually DEXs are pro-anonymity, and a Know Your Customer (KYC) process is typically not required of traders. A transaction occurs between two entities, with cryptocurrencies moving from a seller’s wallet to the buyer’s. Since there is no central authority controlling the trades (except for running the portal and facilitating aggregation), there is typically no way to reverse transactions made on a DEX.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "DeFi",
            "intro_desc": "<p>Decentralized Finance or DeFi is a collective term for the entire range of financial applications based on blockchain networks. The main aim of this methodology is to promote a financial system that is distributed and decentralized, with any central authority figure. This is in-line with the core concept of cryptocurrencies - open-source and permissionless means of transacting on a peer-to-peer basis.</p>",
            "description": [
                {
                    "title": "Additional information:",
                    "paragraphs": [
                        "<p>DeFi protocols, similar to the cryptocurrencies they are inspired from, constitute anonymous and peer-to-peer blockchain networks, which allows unrestricted access to all apps on a DeFi system for anyone with a connection to the internet. An open-source code-base allows for public auditing and verification of the DeFi’s security measures, as well as transparency and accountability.</p>",
                        "<p>While Bitcoin is one of the first instances of a widely used DeFi application, current DeFi systems use Ethereum, due to its support for a multitude of peer-to-peer based applications instead of a simple transaction-based model like Bitcoin. Decentralized exchanges, or DEXs, a host of protocols that enable a system of credit (akin to loans) and even peer-to-peer insurance protocols are some major applications of DeFi methodologies.</p>"
                    ]
                }
            ]
        } 
    ],
    "E": [
        {
            "intro_title": "Ether",
            "intro_desc": "<p>Ether is the native currency of the Ethereum blockchain; Ether is generally referred to as Ethereum or by its ticker ETH. Ether pays for the computing power and other services offered by Ethereum, a type of decentralized internet and app system.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>Ether does not require a third party to process a transaction since it is a blockchain and hence is not owned by anyone. Ether should be considered as fuel for building the apps on the decentralized Ethereum network.</p>",
                        "<p>Considering Ether as digital money can be misleading since Ether follows the same underlying principle of demand and supply. If more people use it, Ether's demand shall rise, and so will the price, just like oil. Therefore Ether should be considered a commodity or programmable money.</p>"
                    ]
                }
            ]
        }       
    ],
    "H": [
        {
            "intro_title": "Halving",
            "intro_desc": "<p>Halving is a phenomena exclusive to Bitcoin, where on a cycle of 4 years, the number of bitcoins given as a reward for successfully mining a new block is reduced by half. This means every 4 years, miners get a 50% reduction in their rewards.</p>",
            "description": [
                {
                    "title": "Additional Information:",
                    "paragraphs": [
                        "<p>Satoshi had initially set 50 bitcoins as the reward for being the first to mine and add a new block to the blockchain. Halving the number of bitcoins received as a reward will continue after an interval of 210,000 blocks until the last bitcoin will be mined, projected to be the year 2140. The last halving for Bitcoin was on 11 May 2020, at around 3 pm, with the reward dropping to 6.25 bitcoins from 12.5.</p>",
                        "<p>Halvings generally cause a steep rise in Bitcoin’s value due to a bullish market trend. Bitcoin’s price went up to $20,000 after halving from $650, and then settled down to $3,200 as the year progressed. The idea of halving is to ensure inflation in Bitcoin’s economy, as the reduced supply of Bitcoins (capped at 21 million) causes greater demand and subsequently higher prices and incentive for miners to keep mining Bitcoin. However, this also leads to a very volatile market that encourages speculation and unpredictability.</p>"
                    ]
                }
            ]
        }       
    ],
    "L": [
        {
            "intro_title": "Leverage",
            "intro_desc": "<p>The term leverage simply refers to how many times the trader has increased the position. For example, if you open a 100x long position on Bitcoin, you will get 100x times the profits you invested. In cryptocurrency high leverage, trading is risky since they can liquidate your funds.</p>",
            "description": []
        }       
    ],
    "M": [
        {
            "intro_title": "Margin Trading",
            "intro_desc": "<p>Margin trading is a method of trading cryptocurrencies using funds provided by a third party; compared to spot or regular trading, a margin account allows traders to trade with a larger sum of capital and adjust leverage to their positions. This way, traders can have a chance of earning more profits than usual on successful trades. But with greater chances of profits comes greater chances of loss.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>In traditional markets, the margin funds are usually provided by institutional investors in return for interests; however, in the cryptocurrency market, these funds are provided by other traders who earn interest based on market demand.</p>"
                    ]
                }
            ]
        }       
    ],
    "R": [
        {
            "intro_title": "REKT",
            "intro_desc": "<p>REKT is a commonly used internet slang, which is a phonetic spelling of the word ‘wrecked’. It means the same thing as the original word it is based upon, which means ‘to be completely destroyed or defeated’. In the world of cryptocurrencies, it is taken to mean total or significant financial loss.</p>",
            "description": [
                {
                    "title": "Additional information:",
                    "paragraphs": [
                        "<p>While the term can change in meaning slightly depending on the context it is used in, in the crypto space, someone could be described as rekt when they make a dubious investment decision or transaction and incur a severe financial loss. Originally the term was used in the gaming community to refer to a player who had been embarrassingly or easily defeated in a game.</p>",
                        "<p>For example, if an altcoin highly valued during its IPO had a much lower price upon being traded on the open market, we could say the token was ‘rekt’, and, in-fact, any investor of the coin could also be ‘rekt’ due to a poor investment choice.</p>"
                    ]
                }
            ]
        }       
    ],
    "S": [
        {
            "intro_title": "Satoshi Nakamoto",
            "intro_desc": "<p>Satoshi Nakamoto is the assumed pseudonym of the person or group who invented Bitcoin, wrote the Bitcoin white paper, and deployed Bitcoin's original reference implementation. Their real identity remains unknown, even more than a decade after Bitcoin’s invention.</p>",
            "description": [
                {
                    "title": "Additional information:",
                    "paragraphs": [
                        "<p>Bitcoin first came into existence in October 2008 when its creator, Satoshi Nakamoto, published a paper on virtual cryptocurrency entitled 'Bitcoin: A Peer-to-Peer Electronic Cash System' on the mailing list for cryptography at metzdowd.com. According to some reports, Nakamoto started working on Bitcoin in 2007 and also registered the domain 'bitcoin.org'. In 2009, with Bitcoin's version 0.1 release, Satoshi mined the genesis block (the first block) of the Bitcoin network.</p>",
                        "<p>In mid-2010, Gavin Andresen was given control of the network alert key and source code repository by Satoshi. He also transferred domains to various prominent members of the Bitcoin community. Today, Satoshi’s bitcoins remain unspent.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>There has been much speculation regarding Satoshi’s real identity. While Satoshi himself claimed to be Japanese, this remains an unconfirmed attribute.</p>",
                        "<p>In the crypto price boom of 2020, the total valuation of Satoshi’s bitcoins crossed US$40 billion.</p>"
                    ]
                }
            ]
        }       
    ]
}
