{
    "B": [
        {
            "intro_title": "Bitcoin",
            "intro_desc": "<p>Bitcoin is digital currency released in 2008. It is the world’s first and biggest [<a href='#Cryptocurrency'>cryptocurrency</a>], since its operation, functioning and issuance are based on the principles of cryptography.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Bitcoin was released in 2008, on the heels of the housing bubble and crash, by an individual or group of people working under the pseudonym Satoshi Nakamoto [link 1.4]. The Bitcoin whitepaper released by Satoshi Nakamoto elaborated on the principles and motivations behind Bitcoin’s introduction and its real-world utility.</p>",
                        "<p>Since the housing bubble crisis was majorly attributed to the abuse of financial power by big banks and financial entities, Bitcoin’s launch was based on the ideals of eradicating this centralized power and giving people power over their money.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>This is why Bitcoin is a decentralized currency. No single authority can govern Bitcoin. Instead, it operates as a peer-to-peer network. Each network entity is called a 'node' and exerts equal power in the network. All this is enabled by blockchain technology, which forms the bedrock of Bitcoin’s functioning.</p>",
                        "<p>The blockchain is immutable, and transparent. So all nodes in a network can see every transaction, and every wallet/s balance. Simultaneously, they are also practically prohibited from changing these, since any change requires the consensus of a majority (51%+) of the network. Every node in the Bitcoin network saves its copy of the blockchain.</p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Bitcoin Mining",
            "intro_desc": "<p>New bitcoins are introduced into the Bitcoin network via a process called mining, and thus into circulation. Simultaneously, transactions are validated, confirmed and propagated on the network. It is the only process of its kind on the Bitcoin network, with no alternative.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Bitcoin is based on a form of distributed ledger technology, called the blockchain. A blockchain is essentially a set of unique blocks of information, where each block is connected to its predecessor, forming a chain. To add a new block to the Bitcoin blockchain, nodes compete to solve complex cryptographic puzzles via their computing hardware. This process is based on a consensus algorithm called 'Proof of Work', which rewards new bitcoins to those nodes that successfully complete the puzzle, and get the opportunity to add new blocks to the Bitcoin blockchain.</p>",
                        "<p>Individuals engaging in this process are called Bitcoin miners, since the process is akin to hunting for bitcoins and finding a reward. Since Bitcoin is decentralized and has no central authority, the network requires a way to determine the legitimacy of each transaction. The Bitcoin miners do this by verifying the transactions based on the rules of the network, and then putting together them in a block. This block is then added to the blockchain and is then forever available for everyone to verify and confirm.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>The cryptographic problems are complex in nature and cannot be practically solved manually. They require specialized, high-performance computing devices, and since the first miner to verify the transactions is rewarded with new Bitcoin units for their efforts, this system incentivizes increasingly powerful systems.</p>",
                        "<p></p>"
                    ]
                }
            ]
        },   
        {
            "intro_title": "Blockchain",
            "intro_desc": "<p>A blockchain is essentially a digital ledger that stores records of transactions, duplicated and distributed across a network of computer systems. Each block in the chain accommodates several transactions. Once a transaction is added or validated, every block in the network adds the transaction into their ledger. </p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>If one of the blocks in the network has been compromised due to a malicious transaction, the blockchain will immediately know that one of the blocks has been tampered with and hence can be terminated. To successfully hack the network, the attackers need to change every block across the distributed versions of the chain. Therefore, it is almost impossible to hack an entire blockchain.</p>",
                        "<p>Bitcoin and Ethereum are some of the most famous blockchain networks in the world. The addition of new blocks in these systems adds up the security of the blockchain.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p></p>",
                        "<p></p>"
                    ]
                }
            ]
        },
        {
            "intro_title": "Bitcoin Futures",
            "intro_desc": "<p>Just like stock or commodities futures, Bitcoin futures is a legal agreement of trading a cryptocurrency at a predetermined date and price. Bitcoin futures allow investors to speculate on the future prices of a given cryptocurrency.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>The introduction of Bitcoin futures has affected markets in a significant way. Investors can carry out leverage trading and benefit from cryptocurrency's volatility without holding Bitcoin.</p>",
                        "<p>There are a number of benefits of futures trading instead of holding or trading in the spot market. Primarily, the contracts are traded on the regulated exchange; these Bitcoin futures are regulated by Commodity Futures Trading Commission, giving institutional investors confidence to participate. Since Bitcoin futures are cash-settled, there no need for a Bitcoin wallet or any kind of physical exchange.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p></p>",
                        "<p></p>"
                    ]
                }
            ]
        }
    ],
    "C": [
        {
            "intro_title": "Cryptocurrency",
            "intro_desc": "<p>A cryptocurrency is a virtual asset secured and operated on the principles of cryptography and often decentralized i.e run without any single authority or entity’s influence.</p>",
            "description": [
                {
                    "title": "Additional Information",
                    "paragraphs": [
                        "<p>Typically, cryptocurrencies are based on a blockchain, and the cryptocurrency network features a group of connected devices called 'nodes.’ Every transaction initiated and completed using a cryptocurrency network is saved in this blockchain.</p>",
                        "<p>A cryptocurrency is usually a community-driven decentralized network for exchange of monetary value, ownership and other analogues. Since it is decentralized, there is no influence of central authorities like governments and financial institutions in the day to day functioning of the cryptocurrency. Instead, a cryptocurrency relies on its ‘blockchain’ for basic operations such as transaction processing, coin issuance, etc.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p>These operations on the blockchain are governed by predefined protocols that determine the fate of all activities on the network. </p>",
                        "<p>Bitcoin is the first, and biggest cryptocurrency. Ethereum is another popular cryptocurrency.</p>"
                    ]
                }
            ]
        }       
    ],
    "E": [
        {
            "intro_title": "Ether",
            "intro_desc": "<p>Ether is the native currency of the Ethereum blockchain; Ether is generally referred to as Ethereum or by its ticker ETH. Ether pays for the computing power and other services offered by Ethereum, a type of decentralized internet and app system.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>Ether does not require a third party to process a transaction since it is a blockchain and hence is not owned by anyone. Ether should be considered as fuel for building the apps on the decentralized Ethereum network.</p>",
                        "<p>Considering Ether as digital money can be misleading since Ether follows the same underlying principle of demand and supply. If more people use it, Ether's demand shall rise, and so will the price, just like oil. Therefore Ether should be considered a commodity or programmable money.</p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p></p>",
                        "<p></p>"
                    ]
                }
            ]
        }       
    ],
    "M": [
        {
            "intro_title": "Margin Trading",
            "intro_desc": "<p>Margin trading is a method of trading cryptocurrencies using funds provided by a third party; compared to spot or regular trading, a margin account allows traders to trade with a larger sum of capital and adjust leverage to their positions. This way, traders can have a chance of earning more profits than usual on successful trades. But with greater chances of profits comes greater chances of loss.</p>",
            "description": [
                {
                    "title": "",
                    "paragraphs": [
                        "<p>In traditional markets, the margin funds are usually provided by institutional investors in return for interests; however, in the cryptocurrency market, these funds are provided by other traders who earn interest based on market demand.</p>",
                        "<p></p>"
                    ]
                },
                {
                    "title": "",
                    "paragraphs": [
                        "<p></p>",
                        "<p></p>"
                    ]
                }
            ]
        }       
    ]
}
